import pandas as pd
import numpy as np


df=pd.read_excel('./data/413719000/413719000.xls')

# lon:110.12347-110.2815  0.00063212
# 经度步长 0.00063212 度 ≈ 70米（在地球表面，1度 ≈ 111公里），适合船舶轨迹分析。
# lat: 20.023834-20.2712   0.000989464
# 纬度步长 0.000989464 度 ≈ 110米，类似地适合轨迹网格化。
# sog:0.0-14.9 0.0596 
# 速度：0.0596 节 ≈ 0.11公里/小时，适合船舶速度的离散化。
# cog：0.0-359 1.436
# 航向：1.436 度将360度划分为250份，适合粗略的方向分析。

data=pd.concat([np.floor((df['经度']-df['经度'].values.min())/0.00063212),
                  np.floor((df['纬度']-df['纬度'].values.min())/0.000989464),
                  np.floor((df['速度']-df['速度'].values.min())/0.0596),
                  np.floor((df['对地航向']-df['对地航向'].values.min())/1.436)],axis=1)
data.to_pickle('./data/413719000/413719000.pkl')